app/app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `email`, `password_digest`, `created_at`, `updated_at`) VALUES ('Joason', 'jie-email@jie-trancender.org', '$2a$10$yM3JULRnOyXpyZfoaLuR9ejHRaZ9WU.NIUAX2w.LVb4pcMecuvAMG', '2016-12-06 06:54:37', '2016-12-06 06:54:37')
---
  def create
      @user = User.create(user_params)

SELECT  `users`.* FROM `users` WHERE `users`.`name` = 'Joason' LIMIT 1
---
  def verify
      @user = User.find_by(name: user_params[:name]).try(:authenticate, user_params[:password])