ATM/app/controllers/articles_controller.rb

INSERT INTO `articles` (`title`, `text`, `created_at`, `updated_at`) VALUES ('fsdf', 'fsd', '2016-12-03 15:52:17', '2016-12-03 15:52:17')
---
    def create
        @article = Article.new(article_params)

        if @article.save

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 2 LIMIT 1
UPDATE `articles` SET `title` = 'fasdfd', `text` = 'f', `updated_at` = '2016-12-03 16:20:06' WHERE `articles`.`id` = 2
---
    def update
        @article = Article.find(params[:id])

        if @article.update(article_params)